{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/problem-statement-1.html",
  "title": "Problem statement",
  "body": "\n\n\n\n\nProblem statement\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: A note on terminology.\n Up: Flat clustering\n Previous: Clustering in information retrieval\n    Contents \n    Index\n\n\n\n\n \n\nProblem statement\n \nWe can define the goal in hard flat clustering as follows.\nGiven (i)\na set of documents  \n, (ii)\na desired number of clusters , and (iii) an  objective\nfunction  that evaluates the quality of a clustering, \nwe want to compute\nan assignment \n\nthat minimizes (or, in other cases, maximizes) the objective\nfunction. In most cases, we also demand that  is\nsurjective, i.e., that none of the  clusters is empty.\n\n\nThe objective function is often defined in terms of\nsimilarity or distance between documents. Below, we will see\nthat the objective in  -means clustering is to minimize the average distance\nbetween documents and their centroids or, equivalently, to\nmaximize the similarity between documents and their centroids.\nThe discussion of similarity measures and distance metrics\nin Chapter 14  (page 14.1 ) also\napplies to\nthis chapter. As in \nChapter 14 , we use both similarity and distance\nto talk about relatedness between documents.\n\n\nFor documents, the type of similarity we want is usually\ntopic similarity or high values on the same dimensions in\nthe vector space model. For example, documents about China\nhave high values on dimensions like Chinese,\nBeijing, and Mao whereas documents about the\nUK tend to have high values for London,\nBritain and Queen. We approximate topic\nsimilarity with cosine similarity or Euclidean distance in\nvector space (Chapter 6 ).  If we intend to\ncapture \nsimilarity of a type other than topic, for example,\nsimilarity of language, then a\ndifferent representation may be appropriate.  When computing\ntopic similarity, stop words can be safely ignored, but they\nare important cues for separating clusters of English (in\nwhich the occurs frequently and la\ninfrequently) and French documents (in which the\noccurs infrequently and la frequently).\n\n\n\n\nSubsections\n\n\n\nA note on terminology.\n\n\n\nCardinality - the number of clusters\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: A note on terminology.\n Up: Flat clustering\n Previous: Clustering in information retrieval\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}