{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/machine-learning-methods-in-ad-hoc-information-retrieval-1.html",
  "title": "Machine learning methods in ad hoc information retrieval",
  "body": "\n\n\n\n\nMachine learning methods in ad hoc information retrieval\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: A simple example of\n Up: Support vector machines and\n Previous: Connections to text summarization.\n    Contents \n    Index\n\n\n\n \n\nMachine learning methods in ad hoc information retrieval\n\n\nRather than coming up with term and document weighting functions by\nhand, as we primarily did in Chapter 6 , we can view different\nsources of relevance signal (cosine score, title match, etc.) as\nfeatures in a learning problem.  A classifier that has been fed\nexamples of relevant and nonrelevant documents for each of a set of queries\ncan then figure out the relative weights of these signals.\nIf we configure the problem so that there are pairs of a document and\na query which are assigned a relevance judgment of relevant or\nnonrelevant, then we can think of this problem too as a text\nclassification problem.  Taking such a classification approach is not necessarily best, and we present an alternative in Section 15.4.2 .  Nevertheless, given the\nmaterial we have covered, the simplest place to start is to approach this\nproblem as a classification problem, by ordering the documents\naccording to the confidence of a two-class classifier in its relevance\ndecision.  And this move is not purely pedagogical; exactly this approach\nis sometimes used in practice.\n\n\n\n\nSubsections\n\nA simple example of machine-learned scoring\nResult ranking by machine learning\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: A simple example of\n Up: Support vector machines and\n Previous: Connections to text summarization.\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}