{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/boolean-retrieval-1.html",
  "title": "Boolean retrieval",
  "body": "\n\n\n\n\nBoolean retrieval\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: An example information retrieval\n Up: irbook\n Previous: Web and contact information\n    Contents \n    Index\n\n\n\n\n\nBoolean retrieval\n\n\nThe meaning of the term\n information retrieval \ncan be very broad. Just getting a credit card out of your wallet so that\nyou can type in the card number is a form of information retrieval.\nHowever, as an academic field of study,  information retrieval \nmight be defined thus:\n\nInformation retrieval (IR) is finding material (usually documents) of an\nunstructured nature (usually text) that satisfies an information need from\nwithin large\ncollections (usually stored on computers).\n\n\nAs defined in this way, information retrieval used to be\nan activity that only a few people engaged in: reference librarians,\nparalegals, and similar professional searchers. Now the world has\nchanged, and hundreds of millions of people engage in information\nretrieval every day when they use a web search engine or search their\nemail.Information retrieval is fast becoming the dominant form of\ninformation access, overtaking traditional database-style searching (the\nsort that is going on when a clerk says to you: ``I'm sorry, I\ncan only look up your order if you can give me your Order ID'').\n\n\nIR can also cover other kinds of data and information problems beyond\nthat specified in the core definition above.\nThe term ``unstructured data'' refers to data\nwhich does not have clear, semantically overt, easy-for-a-computer\nstructure. It is the opposite of structured data, the canonical example\nof which is a relational database, of the sort companies usually use to\nmaintain product inventories and personnel records.\nIn reality, almost no data are truly ``unstructured''. This is definitely\ntrue of all text data if you count the latent linguistic structure of human\nlanguages.  But even accepting that the intended notion of structure is overt\nstructure, most text has structure, such as headings and paragraphs and\nfootnotes, which is commonly represented in documents by explicit\nmarkup (such as the coding underlying web pages).  IR is also used to\nfacilitate ``semistructured'' search such as finding a document where\nthe title contains Java and the body contains threading.\n\n\nThe field of information retrieval also covers supporting users in\nbrowsing or filtering document collections or further processing a set\nof retrieved\ndocuments.  Given a set of documents, clustering is the\ntask of coming up with a good grouping of the documents based on their\ncontents.  It is similar to arranging books on\na bookshelf according to their topic.  Given a set of topics,\nstanding information needs, or other categories (such as suitability of\ntexts for different age groups), classification is the task of deciding\nwhich class(es), if any,\neach of a set of documents belongs to.  It is often approached by first\nmanually classifying some documents and then hoping to be able to\nclassify new documents automatically.\n\n\nInformation retrieval systems can also be distinguished by the scale\nat which they operate, and it is useful to distinguish three prominent\nscales.  In  web search , the system has to provide search\nover billions of documents stored on millions of computers.\nDistinctive issues are needing to gather documents for indexing, being\nable to build systems that work efficiently at this enormous scale,\nand handling particular aspects of the web, such as the exploitation\nof hypertext and not being fooled by site providers manipulating page\ncontent in an attempt to boost their search engine rankings, given the\ncommercial importance of the web.  We focus on all these issues in\nwebcharlink.  At the other extreme is  personal\ninformation retrieval .  In the last few years, consumer operating\nsystems have integrated information retrieval (such as Apple's Mac OS\nX Spotlight or Windows Vista's Instant Search).  Email programs\nusually not only provide search but also text classification: they at\nleast provide a spam (junk mail) filter, and commonly also provide\neither manual or automatic means for classifying mail so that it can\nbe placed directly into particular folders.  Distinctive issues here\ninclude handling the broad range of document types on a typical\npersonal computer, and making the search system maintenance free and\nsufficiently lightweight in terms of startup, processing, and\ndisk space usage that it can run on one machine without annoying its\nowner.  In between is the space of  enterprise,\ninstitutional, and domain-specific search , where retrieval might be\nprovided for collections such as a corporation's internal documents, a\ndatabase of patents, or research articles on biochemistry.  In this\ncase, the documents will typically be stored on centralized file\nsystems and one or a handful of dedicated machines will provide search\nover the collection.  This book contains techniques of value over this whole spectrum,\nbut our coverage of some aspects of parallel and distributed search in web-scale search systems is\ncomparatively light owing to the relatively small published literature on the details of such systems.\nHowever, outside of a handful of web search companies, a software developer is most likely to encounter the personal search and enterprise scenarios.\n\n\nIn this chapter we begin with a very simple example of an information\nretrieval problem, and\nintroduce the idea of a term-document matrix (Section 1.1 )\nand the central inverted index data structure (Section 1.2 ).\nWe will then examine the Boolean retrieval model and how Boolean queries\nare processed ( and 1.4 ).\n\n\n\n\nSubsections\n\nAn example information retrieval problem\nA first take at building an inverted index\nProcessing Boolean queries\nThe extended Boolean model versus ranked retrieval\nReferences and further reading\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: An example information retrieval\n Up: irbook\n Previous: Web and contact information\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}