{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/preface-1.html",
  "title": "Preface",
  "body": "\n\n\n\n\nPreface\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Book organization and course\n Up: irbook\n Previous: Table of Notations\n    Contents \n    Index\n\n\n\n\nPreface\n\n\nAs recently as the 1990s, studies showed that most people preferred getting\ninformation from other people rather than from information retrieval systems.\nOf course, in that time period, most people also used human\ntravel agents to book their travel.\nHowever, during the last decade, relentless\noptimization of\ninformation retrieval effectiveness\nhas driven web search\nengines to new quality levels where most people are satisfied most of\nthe time, and web search has become a standard and often preferred\nsource of information finding.\nFor example, the 2004 Pew Internet Survey (Fallows, 2004) found that ``92% of Internet users say\nthe Internet is a good place to go for getting everyday information.''\nTo the surprise of many, the field of information retrieval has moved from being a primarily academic discipline to being the basis underlying most people's preferred means of information access.\nThis book presents the scientific underpinnings of this\nfield, at a level accessible to graduate students as well as\nadvanced undergraduates.\n\n\nInformation retrieval did not begin with the Web.  In\nresponse to various challenges of providing information\naccess, the field of information retrieval evolved to give\nprincipled approaches to searching various forms of content.  The field began with scientific publications and library records, but soon spread to other forms of content, particularly those of information professionals, such as journalists, lawyers, and doctors.  Much of the scientific research on  information retrieval has occurred in these contexts, and much of the continued practice of information retrieval deals with providing access to unstructured information in various corporate and governmental domains, and this work forms much of the foundation of our book.\n\n\nNevertheless, in recent years, a principal driver of\ninnovation has been the World Wide Web, unleashing\npublication at the scale of tens of millions of content\ncreators.  This explosion of published information would be\nmoot if the information could not be found, annotated and\nanalyzed so that each user can quickly find information that\nis both relevant and comprehensive for their needs.  By the\nlate 1990s, many people felt that continuing to index the\nwhole Web would rapidly become impossible, due to the Web's\nexponential growth in size.  But major scientific\ninnovations, superb engineering, the rapidly declining price\nof computer hardware, and the rise of a commercial\nunderpinning for web search have all conspired to\npower today's major search engines, which are able to\nprovide high-quality results within subsecond response times\nfor hundreds of millions of searches a day over billions of\nweb pages.\n\n\n\n\nSubsections\n\nBook organization and course development\nPrerequisites\nBook layout\nAcknowledgments\nWeb and contact information\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Book organization and course\n Up: irbook\n Previous: Table of Notations\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}