{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/references-and-further-reading-11.html",
  "title": "References and further reading",
  "body": "\n\n\n\n\nReferences and further reading\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Language models for information\n Up: Probabilistic information retrieval\n Previous: Bayesian network approaches to\n    Contents \n    Index\n\n\n\n\nReferences and further reading\n\n\nLonger introductions to probability theory can be found in most introductory probability and statistics books, such as (Ross, 2006, Grinstead and Snell, 1997, Rice, 2006). An introduction to Bayesian utility theory can be found in (Ripley, 1996).\n\n\nThe probabilistic approach to IR originated in the UK in the 1950s.\nThe first major presentation of a probabilistic model is\nMaron and Kuhns (1960).\nRobertson and Jones (1976) introduce the main foundations of the BIM and van Rijsbergen (1979) presents in detail the classic BIM probabilistic model. The idea of the PRP is variously attributed to S. E. Robertson, M. E. Maron and W. S. Cooper (the term ``Probabilistic Ordering Principle'' is used in Robertson and Jones (1976), but PRP dominates in later work). Fuhr (1992) is a more recent presentation of probabilistic IR, which includes coverage of other approaches such as probabilistic logics and Bayesian networks. Crestani et al. (1998) is another survey. Spärck Jones et al. (2000) is the definitive presentation of probabilistic IR experiments by the ``London school'', and Robertson (2005) presents a retrospective on the group's participation in TREC evaluations, including detailed discussion of the Okapi BM25 scoring function and its development.\nRobertson et al. (2004) extend BM25 to the case of\nmultiple weighted fields.\n\n\nThe open-source Indri search engine, which is distributed with the\nLemur toolkit (http://www.lemurproject.org/) merges ideas from\nBayesian inference networks and statistical language modeling\napproaches (see Chapter 12 ), in particular preserving the\nformer's support for structured query operators.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Language models for information\n Up: Probabilistic information retrieval\n Previous: Bayesian network approaches to\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}