{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/exercises-4.html",
  "title": "Exercises",
  "body": "\n\n\n\n\nExercises\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Matrix decompositions and latent\n Up: Hierarchical clustering\n Previous: References and further reading\n    Contents \n    Index\n\n\n\n\nExercises\n\n\nExercises.\n\n   \nA single-link clustering can also be computed from the\n minimum spanning tree  of a graph. The minimum spanning\ntree connects the vertices of a graph\nat the smallest possible cost, where cost is defined as the sum\nover all edges of the graph. In our case the cost of an edge\nis the distance between two documents. \nShow that if \n are the\ncosts of the edges of a minimum spanning tree, then these\nedges correspond to the  merges in constructing a\nsingle-link clustering.\n\n\n\n   Show that\nsingle-link clustering is best-merge persistent and that\nGAAC and centroid clustering are not best-merge persistent.\n\n\n\n\nConsider running 2-means clustering on a\ncollection with documents from two different languages.\nWhat result would you expect? \n\nWould you expect the same\nresult when running an HAC algorithm?\n\n\n\n\nDownload \nReuters-21578. Keep only documents that are in the classes\ncrude,\ninterest, and\ngrain. Discard documents that are members of\nmore than one of these three classes. Compute a (i)\nsingle-link, (ii) complete-link, (iii) GAAC, (iv) centroid\nclustering of the documents. (v) Cut each dendrogram at the\nsecond branch from the top to obtain  clusters. \nCompute the Rand index for each of the 4 clusterings. Which\nclustering method performs best?\n\n\n\n  \nSuppose a run of HAC finds\nthe clustering with  to have\nthe highest value on some prechosen goodness measure of clustering.  Have we found the\nhighest-value clustering among all clusterings with ? \n\n\n\n   \nConsider the task of producing a single-link clustering of  points on a line:\n\n\n\n\n\nShow that we only need to compute a total of about \nsimilarities.\nWhat is the overall complexity of\nsingle-link clustering for a set of points on a line?\n\n\n\n Prove that \nsingle-link, complete-link, and\ngroup-average clustering are monotonic in the sense defined on page 17.1 .\n\n\n\n For  points,\nthere are  different flat clusterings into \nclusters (Section 16.2 ,\npage 16.2.1 ). What is the number of\ndifferent hierarchical clusterings (or\ndendrograms) of  documents? \nAre there more flat clusterings or more hierarchical\nclusterings for given  and ?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Matrix decompositions and latent\n Up: Hierarchical clustering\n Previous: References and further reading\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}