{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/parametric-and-zone-indexes-1.html",
  "title": "Parametric and zone indexes",
  "body": "\n\n\n\n\nParametric and zone indexes\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Weighted zone scoring\n Up: Scoring, term weighting and\n Previous: Scoring, term weighting and\n    Contents \n    Index\n\n\n\n\n \n\nParametric and zone indexes\n\n\nWe have thus far viewed a document as a sequence of terms. In fact, most documents have additional structure. Digital documents generally encode, in machine-recognizable form, certain  metadata  associated with each document. By metadata, we mean specific forms of data about a document, such as its author(s), title and date of publication.  This metadata would generally include  fields  such as the date of creation and the format of the document, as well the author and possibly the title of the document. The possible values of a field should be thought of as finite - for instance, the set of all dates of authorship.\n\n\nConsider queries of the form ``find documents authored by\nWilliam Shakespeare in 1601, containing the phrase\nalas poor Yorick''. Query processing then consists as\nusual of postings intersections, except that we may merge\npostings from standard inverted as well as\n\n parametric indexes . There is one parametric index for each field (say, date of creation); it allows us to select only the documents matching a date specified in the query. Figure 6.1  illustrates the user's view of such a parametric search. Some of the fields may assume ordered values, such as dates; in the example query above, the year 1601 is one such field value. The search engine may support querying ranges on such ordered values; to this end, a structure like a B-tree may be used for the field's dictionary.\n\n\n\n\nParametric search.In this example we have a collection with fields allowing us to select publications by zones such as Author and fields such as Language.\n\n\n\n Zones  are similar to fields, except the\ncontents of a zone can be arbitrary free text. Whereas a\nfield may take on a relatively small set of values, a zone\ncan be thought of as an arbitrary, unbounded amount of\ntext. For instance, document titles and abstracts are\ngenerally treated as zones. We may build a separate\ninverted\nindex for each zone of a document, to support queries such\nas ``find documents with merchant in the title and\nwilliam in the author list and the phrase\ngentle rain in the body''. This has the effect of\nbuilding an index that looks like\nFigure 6.2.  Whereas the dictionary for a\nparametric index comes from a fixed vocabulary (the set of\nlanguages, or the set of dates), the dictionary for a zone\nindex must structure whatever vocabulary stems from the text\nof that zone.\n\n\n\n\n\n\nIn fact, we can reduce the size of the dictionary by encoding the zone in which a term occurs in the postings. In Figure 6.3 for instance, we show how occurrences of william in the title and author zones of various documents are encoded. Such an encoding is useful when the size of the dictionary is a concern (because we require the dictionary to fit in main memory). But there is another important reason why the encoding of Figure 6.3 is useful: the efficient computation of scores using a technique we will call  weighted zone scoring .\n\n\n\n\nFigure 6.3:\nZone index in which the zone is encoded in the postings rather than the dictionary.\n\n\n\n\n\n\nSubsections\n\nWeighted zone scoring\nLearning weights\nThe optimal weight g\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Weighted zone scoring\n Up: Scoring, term weighting and\n Previous: Scoring, term weighting and\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}