{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/capitalizationcase-folding-1.html",
  "title": "Capitalization/case-folding.",
  "body": "\n\n\n\n\nCapitalization/case-folding.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Other issues in English.\n Up: Normalization (equivalence classing of\n Previous: Accents and diacritics.\n    Contents \n    Index\n\n\n\n\nCapitalization/case-folding.\n\n\nA common strategy is to do  case-folding  by reducing all letters to lower\ncase.\nOften this is a good idea: it will allow\ninstances of Automobile at the beginning of a sentence to match\nwith a query of automobile.  It will also help on a web search\nengine when most of your users type in ferrari when they are\ninterested in a Ferrari car.  On the other hand, such case\nfolding can equate words that might better be kept apart.\nMany proper nouns are derived from common nouns and so are distinguished\nonly by case, including companies (General Motors, The\n  Associated Press), government\norganizations (the Fed vs. fed) and person names\n(Bush, Black).  We already mentioned an example of\nunintended query expansion with acronyms, which involved\nnot only acronym normalization \n(C.A.T.  CAT) but also case-folding\n(CAT  cat).\n\n\nFor English, an alternative to making every token lowercase is to just\nmake some tokens lowercase.\nThe simplest heuristic is to convert to lowercase words at the beginning of\na sentence and all words occurring in a title that is all uppercase or in\nwhich most or all words are capitalized.\nThese words are usually ordinary words that have been\ncapitalized.  Mid-sentence capitalized words are left as capitalized\n(which is usually \ncorrect).  This will mostly avoid case-folding in cases where\ndistinctions should be kept apart.  The same task can be done more\naccurately by a machine learning sequence model which uses more features\nto make the decision of when to case-fold. This is known as\n  truecasing .  However, trying to\nget capitalization right in this way probably doesn't help if your users usually\nuse lowercase regardless of the correct case of words. Thus, lowercasing\neverything often remains the most practical solution.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Other issues in English.\n Up: Normalization (equivalence classing of\n Previous: Accents and diacritics.\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}