{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/language-models-for-information-retrieval-1.html",
  "title": "Language models for information retrieval",
  "body": "\n\n\n\n\nLanguage models for information retrieval\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Language models\n Up: irbook\n Previous: References and further reading\n    Contents \n    Index\n\n\n\n\n\nLanguage models for information retrieval\n\n\nA common suggestion to users for coming up with good\nqueries is to think of words that would likely appear in a relevant\ndocument, and to use those words as the query.  The language modeling\napproach to IR directly models that idea: a document is a good match to\na query if the document model is likely to generate the query, which\nwill in turn happen if the document contains the query words often.\nThis approach thus provides a different realization of some of the\nbasic ideas for document ranking which we saw in Section 6.2 (page ). \nInstead of overtly modeling the probability  of relevance of a\ndocument  to a query , as in the traditional probabilistic approach to IR\n(Chapter 11 ), the basic language modeling approach \ninstead builds a \nprobabilistic language model  from each\ndocument , and ranks \ndocuments based on the probability of the model generating the\nquery: .\n\n\nIn this chapter, we first introduce the concept of language models\n(Section 12.1 ) and then describe the basic and most commonly\nused language modeling approach to IR, the Query Likelihood Model\n(Section 12.2 ).  After some comparisons between the language modeling\napproach and other approaches to IR (Section 12.3 ), we\nfinish by briefly describing various extensions to the language\nmodeling approach (Section 12.4 ).\n\n\n\n\nSubsections\n\nLanguage models\n\nFinite automata and language models\nTypes of language models\nMultinomial distributions over words\n\n\nThe query likelihood model\n\nUsing query likelihood language models in IR\nEstimating the query generation probability\nPonte and Croft's Experiments\n\n\nLanguage modeling versus other approaches in IR\nExtended language modeling approaches\nReferences and further reading\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Language models\n Up: irbook\n Previous: References and further reading\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}