{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/references-and-further-reading-1.html",
  "title": "References and further reading",
  "body": "\n\n\n\n\nReferences and further reading\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: The term vocabulary and\n Up: Boolean retrieval\n Previous: The extended Boolean model\n    Contents \n    Index\n\n\n\n\nReferences and further reading\n\n\nThe practical pursuit of computerized information retrieval began in the\nlate 1940s\n(Cleverdon, 1991, Liddy, 2005).\nA great increase in the production of scientific literature, much in\nthe form of less formal technical reports rather than traditional\njournal articles, coupled with the availability of computers, led to\ninterest in automatic document retrieval.  However, in those days,\ndocument retrieval was always based on author, title, and keywords;\nfull-text search came much later.\n\n\nThe article of Bush (1945) provided lasting inspiration for the\nnew field:\n\n``Consider a future device for individual use, which is a sort of\nmechanized private file and library. It needs a name, and, to coin one\nat random, `memex' will do. A memex is a device in which an individual\nstores all his books, records, and communications, and which is\nmechanized so that it may be consulted with exceeding speed and\nflexibility. It is an enlarged intimate supplement to his memory.''\n\n\nThe term Information Retrieval was coined by Calvin Mooers in\n1948/1950 (Mooers, 1950).\n\n\nIn 1958, much newspaper attention was paid to demonstrations at a\nconference (see Taube and Wooster, 1958) of IBM ``auto-indexing''\nmachines, based primarily on the work of H. P. Luhn.\nCommercial interest quickly\ngravitated towards Boolean retrieval systems, but the early years saw a\nheady debate over various disparate technologies for retrieval\nsystems.  For example Mooers (1961) dissented:\n\n``It is a common fallacy, underwritten at this date by\n  the investment of several million dollars in a variety of retrieval\n  hardware, that the algebra of George Boole (1847) is the appropriate\n  formalism for retrieval system design. This view is as widely and\n  uncritically accepted as it is wrong.''\n\n\nThe observation of AND vs. OR giving you opposite extremes\nin a precisionrecall tradeoff, but not the middle ground comes\nfrom (Lee and Fox, 1988).\n\n\nThe book (Witten et al., 1999) is the standard reference for an in-depth\ncomparison of the space and time efficiency of the inverted index versus\nother possible data structures; a more succinct and up-to-date presentation appears in\nZobel and Moffat (2006).  We further discuss several approaches\nin Chapter 5 .\n\n\nFriedl (2006) covers the practical usage of  regular\n  expressions  for searching.  The underlying computer science appears\nin (Hopcroft et al., 2000).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: The term vocabulary and\n Up: Boolean retrieval\n Previous: The extended Boolean model\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}