{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/the-10-loss-case-1.html",
  "title": "The 1/0 loss case",
  "body": "\n\n\n\n\nThe 1/0 loss case\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: The PRP with retrieval\n Up: The Probability Ranking Principle\n Previous: The Probability Ranking Principle\n    Contents \n    Index\n\n\n\n\nThe 1/0 loss case\n\n\nWe assume a ranked retrieval setup as in Section 6.3 , where there is a collection of documents, the user issues a query, and an ordered list of documents is returned. We also assume a binary notion of relevance as in Chapter 8 .  For a query  and a document  in the collection, let  be an indicator random variable that says whether  is relevant with respect to a given query .  That is, it takes on a value of 1 when the document is relevant and 0 otherwise.  In context we will often write just  for .\n\n\nUsing a probabilistic model, the obvious order in which to present documents to the user is to rank documents by their estimated probability of relevance with respect to the information need: .\nThis is the basis of the  Probability Ranking Principle  (PRP) (van Rijsbergen, 1979, 113-114):\n\n``If a reference retrieval system's response to each request is a ranking of the documents in the collection in order of decreasing probability of relevance to the user who submitted the request, where the probabilities are estimated as accurately as possible on the basis of whatever data have been made available to the system for this purpose, the overall effectiveness of the system to its user will be the best that is obtainable on the basis of those data.''\n\n\nIn the simplest case of the PRP, there are no retrieval costs or other\nutility concerns that would differentially weight actions or errors.\nYou lose a point for either returning a nonrelevant document or failing\nto return a relevant document (such a binary situation where you are evaluated on your accuracy is called\n 1/0 loss ). The goal is to return the best possible results as the top  documents, for any value of  the user chooses to examine.  The PRP then says to simply rank all documents in decreasing order of .\nIf a set of retrieval results is to be returned, rather than an\nordering, the  Bayes Optimal Decision Rule , the decision which\nminimizes the risk of loss, is to simply return documents that are more\nlikely relevant than nonrelevant:\n\n\n\n\n\n\n(61)\n\n\n\nTheorem.\nThe PRP is optimal, in the sense that it minimizes the expected\nloss (also known as the  Bayes risk ) under 1/0 loss. \nEnd theorem.\n\nThe proof can be found in Ripley (1996). However, it requires that all probabilities are known correctly.  This is never the case in practice. Nevertheless, the PRP still provides a very useful foundation for developing models of IR.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: The PRP with retrieval\n Up: The Probability Ranking Principle\n Previous: The Probability Ranking Principle\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}