{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/references-and-further-reading-3.html",
  "title": "References and further reading",
  "body": "\n\n\n\n\nReferences and further reading\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Index construction\n Up: Dictionaries and tolerant retrieval\n Previous: Phonetic correction\n    Contents \n    Index\n\n\n\n\n \n\nReferences and further reading\n\n\nKnuth (1997) is a comprehensive source for information on search trees, including B-trees and their use in searching through dictionaries.\n\n\nGarfield (1976) gives one of the first complete descriptions of the permuterm index. Ferragina and Venturini (2007) give an approach to addressing the space blowup in permuterm indexes.\n\n\nOne of the earliest formal treatments of spelling correction\nwas due to Damerau (1964).  The notion of edit distance that\nwe have used is due to Levenshtein (1965) and the\nalgorithm in Figure 3.5  is due to Wagner and Fischer (1974). Peterson (1980)\nand Kukich (1992) developed variants of methods based on\nedit distances, culminating in a detailed empirical study of\nseveral methods by Zobel and Dart (1995), which shows that\n-gram indexing is very effective for finding candidate\nmismatches, but should be combined with a more fine-grained\ntechnique such as edit distance to determine the most likely\nmisspellings.  Gusfield (1997) is a standard\nreference on string algorithms such as edit distance.\n\n\nProbabilistic models (``noisy channel'' models) for spelling correction were pioneered by Kernighan et al. (1990) and further developed by Brill and Moore (2000) and Toutanova and Moore (2002). In these models, the mis-spelled query is viewed as a probabilistic corruption of a correct query.  They have a similar mathematical basis to the language model methods presented in Chapter 12 , and also provide ways of incorporating phonetic similarity, closeness on the keyboard, and data from the actual spelling mistakes of users. Many would regard them as the state-of-the-art approach. Cucerzan and Brill (2004) show how this work can be extended to learning spelling correction models based on query reformulations in search engine logs.\n\n\nThe soundex algorithm is attributed to Margaret K. Odell and\nRobert C. Russelli (from U.S. patents granted in 1918 and\n1922); the version described here draws on\nBourne and Ford (1961). Zobel and Dart (1996) evaluate various\nphonetic matching algorithms, finding that a variant of the\nsoundex algorithm performs poorly for general spelling\ncorrection, but that other algorithms based on the phonetic\nsimilarity of term pronunciations perform well. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Index construction\n Up: Dictionaries and tolerant retrieval\n Previous: Phonetic correction\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}