{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/issues-in-the-classification-of-text-documents-1.html",
  "title": "Issues in the classification of text documents",
  "body": "\n\n\n\n\nIssues in the classification of text documents\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Choosing what kind of\n Up: Support vector machines and\n Previous: Experimental results\n    Contents \n    Index\n\n\n\n \n\nIssues in the classification of text documents\n\n\nThere are lots of applications of text classification in the\ncommercial world; email spam filtering is perhaps now the most\nubiquitous.  Jackson and Moulinier (2002) write: ``There is no question\nconcerning the commercial value of being able to classify documents\nautomatically by content. There are myriad potential applications of\nsuch a capability for corporate Intranets, government departments, and\nInternet publishers.''\n\n\nMost of our discussion of classification has focused on introducing\nvarious machine learning methods rather than discussing particular\nfeatures of text documents relevant to classification.  This bias is\nappropriate for a textbook, but is misplaced for an application\ndeveloper.  It is frequently the case that greater performance gains\ncan be achieved from exploiting domain-specific text features than\nfrom changing from one machine learning method to another.\nJackson and Moulinier (2002) suggest that ``Understanding the data is one\nof the keys to successful categorization, yet this is an area in which\nmost categorization tool vendors are extremely weak. Many of the `one\nsize fits all' tools on the market have not been tested on a wide\nrange of content types.'' In this section we wish to step back a little\nand consider the applications of text classification, the space of\npossible solutions, and the utility of application-specific\nheuristics.\n\n\n\n\nSubsections\n\nChoosing what kind of classifier to use\nImproving classifier performance\n\nLarge and difficult category taxonomies\nFeatures for text\nDocument zones in text classification\n\nUpweighting document zones.\nSeparate feature spaces for document zones.\nConnections to text summarization.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Choosing what kind of\n Up: Support vector machines and\n Previous: Experimental results\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}