{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/separate-feature-spaces-for-document-zones-1.html",
  "title": "Separate feature spaces for document zones.",
  "body": "\n\n\n\n\nSeparate feature spaces for document zones.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Connections to text summarization.\n Up: Document zones in text\n Previous: Upweighting document zones.\n    Contents \n    Index\n\n\n\n\nSeparate feature spaces for document zones.\n There are two\nstrategies that can be used for document zones.  Above we upweighted\nwords that appear in certain zones.  This means that we are using the\nsame features (that is, parameters are \n   \nacross\ndifferent zones), but we pay more attention to the occurrence of terms\nin particular zones.  An alternative strategy is to have a completely\nseparate set of features and corresponding parameters for words\noccurring in different zones.  This is in principle more powerful: a\nword could usually indicate the topic Middle East when in the\ntitle but Commodities when in the body of a document.  But, in\npractice, tying parameters is usually more successful.  Having\nseparate feature sets means having two or more times as many\nparameters, many of which will be much more sparsely seen in the\ntraining data, and hence with worse estimates, whereas upweighting has\nno bad effects of this sort.  Moreover, it is quite uncommon for words\nto have different preferences when appearing in different zones; it is\nmainly the strength of their vote that should be adjusted.\nNevertheless, ultimately this is a contingent result, depending on the\nnature and quantity of the training data.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Connections to text summarization.\n Up: Document zones in text\n Previous: Upweighting document zones.\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}