{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/positional-postings-and-phrase-queries-1.html",
  "title": "Positional postings and phrase queries",
  "body": "\n\n\n\n\nPositional postings and phrase queries\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Biword indexes\n Up: The term vocabulary and\n Previous: Faster postings list intersection\n    Contents \n    Index\n\n\n\n \n\nPositional postings and phrase queries\n\n\nMany complex or technical concepts and many organization and product\nnames are multiword compounds or phrases.  We would like to be\nable to pose a query\nsuch as Stanford University by treating it as a phrase so that a\nsentence in a document like The inventor Stanford\n  Ovshinsky never went to university. is\nnot a match.  Most recent search engines support a double quotes\nsyntax (``stanford university'') for  phrase queries , which has\nproven to \nbe very easily understood and successfully used by users.  As many as 10%\nof web queries are phrase queries, and many more are implicit phrase\nqueries (such as person names), entered without use of double quotes.\nTo be able to support such queries, it is no longer sufficient for\npostings lists to be simply lists of documents that contain individual terms.\nIn this section we consider two approaches to supporting\nphrase queries and their combination.  A search engine should not only \nsupport phrase queries, but implement them efficiently.\nA related but distinct concept is term proximity weighting,\nwhere a document is preferred to the extent that the query terms appear\nclose to each other in the text.  This technique is covered in\nSection 7.2.2 (page ) in the context of ranked retrieval.\n\n\n\n\nSubsections\n\nBiword indexes\nPositional indexes\n\nPositional index size.\n\n\nCombination schemes\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Biword indexes\n Up: The term vocabulary and\n Previous: Faster postings list intersection\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}