{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/user-utility-1.html",
  "title": "User utility",
  "body": "\n\n\n\n\nUser utility\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Refining a deployed system\n Up: A broader perspective: System\n Previous: System issues\n    Contents \n    Index\n\n\n\n\nUser utility\n\n\nWhat we would really like is a way of\nquantifying aggregate user happiness, based on the relevance, speed, and\nuser interface of a system.\nOne part of this is understanding the distribution of people we wish to\nmake happy, and this depends entirely on the setting.  For a web search\nengine, happy search users are those who find what they want.  One\nindirect measure of such users is that they tend to return to the same\nengine.  Measuring the rate of return of users is thus an effective\nmetric, which would of course be more effective if you could also\nmeasure how much these users used other search engines.  But\nadvertisers are also users of modern web search engines. \nThey are happy if customers click through to their sites and then make\npurchases.  On an eCommerce web site, a user is likely to be\nwanting to purchase something.  Thus, we can\nmeasure the time to purchase, or the fraction of searchers who\nbecome buyers.  On a shopfront web site, perhaps both the\nuser's and the store owner's needs are satisfied if a purchase is made.  \nNevertheless,\nin general, we need to decide whether it is the end user's or the\neCommerce site owner's happiness that we are trying to optimize.\nUsually, it is the store owner who is paying us.\n\n\nFor an ``enterprise'' (company, government, or academic) intranet search\nengine, the relevant metric is more likely to be user productivity: how\nmuch time do users spend looking for information that they need.  There\nare also many other practical criteria concerning such matters as\ninformation security, which we mentioned in Section 4.6 (page ).\n\n\nUser happiness is elusive to measure, and this is part of why the\nstandard methodology uses the proxy of relevance of search results.\nThe standard direct way to get at user satisfaction is to run user\nstudies, where people engage in tasks, and usually various metrics are\nmeasured, the participants are observed, and ethnographic interview\ntechniques are used to get qualitative information on satisfaction.\nUser studies are very useful in system design, but they are time\nconsuming and expensive to do.  They are also difficult to do well, and\nexpertise is required to design the studies and to interpret the\nresults.  We will not discuss the details of human usability testing\nhere. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Refining a deployed system\n Up: A broader perspective: System\n Previous: System issues\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}