{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/query-expansion-1.html",
  "title": "Query expansion",
  "body": "\n\n\n\n\nQuery expansion\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Automatic thesaurus generation\n Up: Global methods for query\n Previous: Vocabulary tools for query\n    Contents \n    Index\n\n\n\n \n\nQuery expansion\n\n\n\n\nAn example of query expansion in the interface of the\n  Yahoo! web search engine in 2006.The expanded query suggestions\n  appear just below the ``Search Results'' bar.\n\n\nIn relevance feedback, users give additional input on documents (by marking documents in the results set as relevant or not), and this input is used to reweight the terms in the query for documents. In  query expansion  on the other hand, users give additional input on query words or phrases, possibly suggesting additional query terms. Some search engines (especially on the web) suggest related queries in response to a query; the users then opt to use one of these alternative query suggestions. Figure 9.6  shows an example of query suggestion options being presented in the Yahoo! web search engine. The central question in this form of query expansion is how to generate alternative or expanded queries for the user. The most common form of query expansion is global analysis, using some form of thesaurus. For each term  in a query, the query can be automatically expanded with synonyms and related words of  from the thesaurus. Use of a thesaurus can be\ncombined with ideas of term weighting: for instance, one might weight added terms less than original query terms.\n\n\n\n\n\n\nMethods for building a thesaurus for query expansion include:\n\n\nUse of a controlled vocabulary that is maintained by\n  human editors. Here, there is a canonical term for each concept. The subject headings\n  of traditional library subject indexes, such as the Library of\n  Congress Subject Headings, or the Dewey Decimal system are examples of\n  a controlled vocabulary. Use of a controlled vocabulary\n  is quite common for well-resourced domains. A well-known example is\n  the Unified Medical Language System (UMLS) used with MedLine for\n  querying the biomedical research literature.\n  For example, in Figure 9.7 , neoplasms\n  was added to a search for cancer.  This Medline query expansion also contrasts with the Yahoo! example.  The Yahoo! interface is a case of interactive query expansion, whereas PubMed does automatic query expansion. Unless the user chooses to examine the submitted query, they may not even realize that query expansion has occurred.\n\n\n\nA manual thesaurus. Here, human editors have built up sets of synonymous\n  names for concepts, without designating a canonical term. The UMLS\n  metathesaurus is one example of a\n  thesaurus. Statistics Canada maintains a thesaurus\n  of preferred terms, synonyms, broader terms, and narrower terms for\n  matters on\n  which the government collects statistics, such as goods and services.\n  This thesaurus is also bilingual English and French.\n\n\n\nAn automatically derived thesaurus. Here, word co-occurrence\n  statistics over a collection of documents in a domain are used to\n  automatically induce a thesaurus; see Section 9.2.3 .\n\n\n\nQuery reformulations based on query log mining. Here, we exploit\n  the manual query reformulations of other users to make suggestions to\n  a new user. This requires a huge query volume, and is thus\n  particularly appropriate to web search.\n\n\nThesaurus-based query expansion has the advantage of not requiring any\nuser input. Use of query expansion\ngenerally increases recall and is widely used in many science and\nengineering fields.\nAs well as such global analysis techniques, it is also possible to do\nquery expansion by local analysis, for instance, by\nanalyzing the documents in the result set. User input is now usually\nrequired, but a distinction remains as to\nwhether the user is giving feedback on documents or on query terms.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Automatic thesaurus generation\n Up: Global methods for query\n Previous: Vocabulary tools for query\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}