{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/probabilistic-relevance-feedback-1.html",
  "title": "Probabilistic relevance feedback",
  "body": "\n\n\n\n\nProbabilistic relevance feedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: When does relevance feedback\n Up: Relevance feedback and pseudo\n Previous: The #rocchio71### algorithm.\n    Contents \n    Index\n\n\n\n \n\nProbabilistic relevance feedback\n\n\nRather than reweighting the query in a vector space, if a user has told\nus some relevant and nonrelevant documents, then we can proceed to\nbuild a   .  One way of doing this is with a\nNaive Bayes probabilistic model.\nIf  is a Boolean indicator variable expressing\nthe relevance of a document, then we can estimate , the probability of a\nterm  appearing in a document,  depending on whether it is relevant\nor not, as:\n\n\n\n\n\n\n\n\n(50)\n\n\n\n\n(51)\n\n\nwhere  is the total number of documents,  is the number that\ncontain ,  is the set of known relevant documents, and  is the subset of this set containing . Even though the set of known relevant documents is a perhaps small subset of the true set of relevant documents, if we assume that the set of relevant documents is a small subset of the set of all documents then the estimates given above will be reasonable.\nThis gives a basis for another way of changing the query term\nweights. We will discuss such probabilistic approaches more in\nChapters 11 13 , and in particular outline the application to relevance feedback in Section 11.3.4 (page ).  For the moment, observe that using just Equation 50 as a basis for term-weighting is likely insufficient.\nThe equations use only collection statistics and information about the term\ndistribution within the\ndocuments judged relevant. They preserve no memory of the original query.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: When does relevance feedback\n Up: Relevance feedback and pseudo\n Previous: The #rocchio71### algorithm.\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}