{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/summary-1.html",
  "title": "Summary",
  "body": "\n\n\n\n\nSummary\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Global methods for query\n Up: Relevance feedback and pseudo\n Previous: Indirect relevance feedback\n    Contents \n    Index\n\n\n\n\nSummary\n\n\nRelevance feedback has been shown to be very effective at improving\nrelevance of results. Its successful use requires queries for which the\nset of relevant documents is medium to large.\nFull relevance feedback is often onerous for the user, and its\nimplementation is not very efficient in most IR systems.\nIn many cases, other types of interactive retrieval may improve\nrelevance by about as much with less work.\n\n\nBeyond the core ad hoc retrieval scenario, other uses of relevance feedback include:\n\n\nFollowing a changing information need (e.g., names of car models\n  of interest change over time)\n\nMaintaining an information filter (e.g., for a news feed). Such\n  filters are discussed further in Chapter 13 .\n\nActive learning (deciding which examples it is most useful to know\n  the class of to reduce annotation costs).\n\n\n\nExercises.\n\nUnder what conditions would the modified query\n in Equation 49 be the same as the\noriginal query ? In all other cases, is  closer\nthan  to the centroid of the relevant documents?\n\n\n\nWhy is positive feedback likely to be more useful than\nnegative feedback to an IR system? Why might only using one\nnonrelevant document be more effective than using several?\n\n\n\nSuppose that a user's initial query is\ncheap CDs cheap DVDs extremely cheap CDs. The user\nexamines two documents,  and . She judges ,\nwith the content CDs cheap software cheap CDs\nrelevant and \nwith content cheap thrills DVDs\nnonrelevant.\nAssume that we are using direct term frequency (with no\nscaling and no document frequency). There is no need to\nlength-normalize vectors. Using Rocchio relevance feedback\nas in Equation 49 what would the revised query vector be after relevance\nfeedback? Assume \n.\n\n\n\nOmar has implemented a relevance feedback web search system, where he is going to do relevance feedback based only on words in the title text returned for a page (for efficiency). The user is going to rank 3 results. The first user, Jinxing, queries for:\n\nbanana slug\n\n\nand the top three titles returned are:\n\nbanana slug Ariolimax columbianus\n\nSanta Cruz mountains banana slug \n\nSanta Cruz Campus Mascot\n\n\nJinxing judges the first two documents relevant, and the third nonrelevant.  Assume that Omar's search engine uses term frequency but no length normalization nor IDF. Assume that he is using the Rocchio relevance feedback mechanism, with \n.\nShow the final revised query that would be run. (Please list the vector elements in alphabetical order.)\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Global methods for query\n Up: Relevance feedback and pseudo\n Previous: Indirect relevance feedback\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}