{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/positional-index-size-1.html",
  "title": "Positional index size.",
  "body": "\n\n\n\n\nPositional index size.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Combination schemes\n Up: Positional indexes\n Previous: Positional indexes\n    Contents \n    Index\n\n\n\n\nPositional index size.\n\n\nAdopting a positional index expands required postings storage significantly,\neven if we compress position values/offsets as we will discuss in\nSection 5.3 (page ).  Indeed, \nmoving to a positional index also changes the asymptotic complexity of\na postings intersection operation, because the number of items to check\nis now bounded not by the number of documents but by the total number of tokens\nin the document collection . \n That is, the complexity of a Boolean query is  rather than \n.\nHowever, most applications \nhave little choice but to accept this, since most users\nnow expect to have the functionality of\nphrase and proximity searches.  \n\n\nLet's examine the space implications of having a positional index.\nA posting now needs an entry for each occurrence of a term.\nThe index size thus depends on the average document size.\nThe average web page has less than 1000 terms, but documents like \nSEC stock filings, books, and even some epic poems  easily\nreach 100,000 terms.\nConsider a term with frequency 1 in 1000 terms on average.  The result\nis that large documents cause an increase of two orders of magnitude in the\nspace required to store the postings list:\n\n\n \nExpected\nExpected entries\n\nDocument size\npostings\nin positional posting\n\n1000\n1\n1\n\n100,000\n1\n100\n\n\n\nWhile the exact numbers depend on the type of documents and the language\nbeing indexed, some rough rules of thumb are to expect a positional index\nto be 2 to 4 times as large as a non-positional index, and to expect a\ncompressed positional index to be about one third to one half the size\nof the raw text (after removal of markup, etc.) of the original\nuncompressed documents. \nSpecific numbers for an example collection\nare given in\nTable 5.1  (page 5.1 ) and\nTable 5.6  (page 5.6 ).\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Combination schemes\n Up: Positional indexes\n Previous: Positional indexes\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}