{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/language-modeling-versus-other-approaches-in-ir-1.html",
  "title": "Language modeling versus other approaches in IR",
  "body": "\n\n\n\n\nLanguage modeling versus other approaches in IR\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Extended language modeling approaches\n Up: Language models for information\n Previous: Ponte and Croft's Experiments\n    Contents \n    Index\n\n\n\n \n\nLanguage modeling versus other approaches in IR\n\n\nThe language modeling approach provides a novel way of looking at the\nproblem of text retrieval, which links it with a lot of recent work in\nspeech and language processing.\nAs Ponte and Croft (1998) emphasize, the language modeling approach to IR\nprovides a different approach to scoring matches between queries and\ndocuments, and the hope is that the probabilistic language modeling\nfoundation improves the weights that are used, and hence the performance\nof the model.  The major issue is estimation of the document model, such\nas choices of how to smooth it effectively.  The model has achieved very good\nretrieval results.  Compared to other probabilistic approaches, such\nas the BIM\nfrom Chapter 11 , the main difference initially appears to be\nthat the LM approach does away with explicitly modeling relevance\n(whereas this is \nthe central variable evaluated in the BIM approach).  But this\nmay not be the correct way to think about things, as some of the\npapers in Section 12.5  further discuss.  The LM approach\nassumes that documents and expressions of information needs are\nobjects of the same type, and assesses their match by importing the\ntools and methods of language modeling from speech and natural language\nprocessing.  The resulting model is mathematically precise, conceptually\nsimple, computationally tractable, and intuitively appealing. \nThis seems similar to the situation with XML retrieval\n(Chapter 10 ): there the approaches that\nassume queries and documents are objects of the same type\nare also among the most successful.\n\n\nOn the other hand, like all IR models, you can also raise objections to\nthe model.  The assumption of equivalence between document and information\nneed representation is unrealistic.  Current LM approaches use very\nsimple models of language, usually unigram models.  Without an explicit\nnotion of relevance, relevance feedback is difficult to integrate into\nthe model, as are user preferences.\nIt also seems necessary to move beyond a unigram model to accommodate\nnotions of phrase or passage matching or Boolean retrieval operators.  Subsequent\nwork in the LM approach has looked at addressing some of these\nconcerns, including putting relevance back into the model and allowing a\nlanguage mismatch between the query language and the document language.\n\n\nThe model has significant relations to traditional tf-idf models.  Term\nfrequency is directly \nrepresented\nin tf-idf models, and much recent work has\nrecognized the importance of document length normalization.  The effect\nof doing a mixture of document generation probability with collection\ngeneration probability is a little like idf: terms rare in the general\ncollection but common in some documents will have a greater influence on\nthe ranking of documents.  In most concrete realizations, the models\nshare treating terms as if they were independent.  On the other hand, the\nintuitions are probabilistic rather than geometric, the mathematical\nmodels are more principled rather than heuristic, and the details of how\nstatistics like term frequency and document length are used differ.\nIf you are concerned mainly with performance numbers, recent work has\nshown the LM approach to be very effective in retrieval experiments,\nbeating tf-idf and BM25 weights. Nevertheless, there is perhaps still \ninsufficient evidence that its performance so greatly exceeds that of\na well-tuned traditional  vector space retrieval system as to justify\nchanging an existing implementation.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Extended language modeling approaches\n Up: Language models for information\n Previous: Ponte and Croft's Experiments\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}