{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/the-rocchio71-algorithm-1.html",
  "title": "The #rocchio71### algorithm.",
  "body": "\n\n\n\n\nThe #rocchio71### algorithm.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Probabilistic relevance feedback\n Up: The Rocchio algorithm for\n Previous: The underlying theory.\n    Contents \n    Index\n\n\n\n\nThe Rocchio (1971) algorithm.\n\n\n\n\nAn application of Rocchio's algorithm.Some documents have\n  been labeled as relevant and nonrelevant and the initial query vector\n  is moved in response to this feedback.\n\n\n  This was the relevance\nfeedback mechanism introduced in and popularized\nby Salton's  SMART  system around 1970.\nIn a real IR query context, we have a user query and partial knowledge of known relevant and nonrelevant documents. The algorithm proposes using the modified query :\n\n\n\n\n\n\n(49)\n\n\nwhere  is the original query vector,  and  are the set of known relevant and nonrelevant documents respectively, and , , and   are weights attached to each term. These control the balance between trusting the judged document set versus the query: if we have a lot of judged documents, we would like a higher  and . Starting from , the new query moves you some distance toward the centroid of the\nrelevant documents and some distance away from the centroid of the\nnonrelevant documents. This new query can be used for retrieval in the standard vector space model (see Section 6.3 ).\nWe can easily leave the positive\nquadrant of the vector space by subtracting off a nonrelevant document's\nvector. In the Rocchio algorithm, negative term weights are ignored.\nThat is, the term weight is set to 0. Figure 9.4  shows the\neffect of applying relevance feedback.\n\n\nRelevance feedback can improve both recall and precision. But, in practice,\nit has been shown to be most useful for increasing\nrecall in situations where recall is important. This is partly\nbecause the technique expands the query, but it is also partly an effect\nof the use case: when they\n  want high recall, users can be expected to take time\nto review results and to iterate on the search.\nPositive feedback also turns out to be much more valuable\nthan negative feedback, and so most IR systems set \n.\nReasonable values might be , , and\n. In fact, many systems, such as the image search system in Figure 9.1 , allow only positive feedback, which is equivalent to setting . Another alternative is to use only the marked nonrelevant document which received the highest ranking from the IR system as negative feedback (here, \nin Equation 49). While many of the experimental results comparing various relevance feedback variants are rather inconclusive, some studies have suggested that this variant, called  Ide dec-hi  is the most effective or at least the most consistent performer.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Probabilistic relevance feedback\n Up: The Rocchio algorithm for\n Previous: The underlying theory.\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}