{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/references-and-further-reading-21.html",
  "title": "References and further reading",
  "body": "\n\n\n\n\nReferences and further reading\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Bibliography\n Up: Link analysis\n Previous: Choosing the subset of\n    Contents \n    Index\n\n\n\n\n \n\nReferences and further reading\n\n\nGarfield (1955) is seminal in the science of citation analysis.  This was built on by Pinski and Narin (1976) to develop a journal influence weight, whose definition is remarkably similar to that of the PageRank measure.\n\n\nThe use of anchor text as an aid to searching and ranking stems from the work of McBryan (1994). Extended anchor-text was implicit in his work, with systematic experiments reported in Chakrabarti et al. (1998).\n\n\nKemeny and Snell (1976) is a classic text on Markov chains.  The\nPageRank measure was developed in Brin and Page (1998)\nand in Page et al. (1998). A number of methods for the\nfast computation of PageRank values are surveyed in\nBerkhin (2005) and in Langville and Meyer (2006); the former\nalso details how the PageRank eigenvector solution may be\nviewed as solving a linear system, leading to one way of\nsolving Exercise 21.2.3 . The effect of the teleport probability  has been studied by Baeza-Yates et al. (2005) and by Boldi et al. (2005). Topic-specific PageRank and variants were developed in Haveliwala (2002), Haveliwala (2003) and in Jeh and Widom (2003). Berkhin (2006a) develops an alternate view of topic-specific PageRank.\n\n\nNg et al. (2001b) suggests that the PageRank score assignment is more robust than HITS in the sense that scores are less sensitive to small changes in graph topology.  However, it has also been noted that the teleport operation contributes significantly to PageRank's robustness in this sense.  Both PageRank and HITS can be ``spammed'' by the orchestrated insertion of links into the web graph; indeed, the Web is known to have such  link farms  that collude to increase the score assigned to certain pages by various link analysis algorithms.\n\n\nThe HITS algorithm is due to Kleinberg (1999). Chakrabarti et al. (1998) developed variants that weighted links in the iterative computation based on the presence of query terms in the pages being linked and compared these to results from several web search engines. Bharat and Henzinger (1998) further developed these and other heuristics, showing that certain combinations outperformed the basic HITS algorithm. Borodin et al. (2001) provides a systematic study of several variants of the HITS algorithm. Ng et al. (2001b) introduces a notion of stability for link analysis, arguing that small changes to link topology should not lead to significant changes in the ranked list of results for a query. Numerous other variants of HITS have been developed by a number of authors, the best know of which is perhaps SALSA (Lempel and Moran, 2000).\n\n\n\n\nWe use the following abbreviated journal and conference names \nin the bibliography:\n\nCACM\nCommunications of the Association for Computing Machinery.\n\nIP&M\nInformation Processing and Management.\n\nIR\nInformation Retrieval.\n\nJACM\nJournal of the Association for Computing Machinery.\n\nJASIS\nJournal of the American Society for Information Science.\n\nJASIST\nJournal of the American Society\nfor Information Science and Technology.\n\nJMLR\nJournal of Machine Learning Research.\n\nTOIS\nACM Transactions on Information Systems.\n\nProc. ACL\nProceedings of the Annual Meeting of the\nAssociation for Computational Linguistics. Available from:\nhttp://www.aclweb.org/anthology-index/\n\nProc. CIKM\nProceedings of the ACM CIKM Conference on Information and Knowledge Management.   ACM Press.\n\nProc. ECIR\nProceedings of the European Conference on Information Retrieval.\n\nProc. ECML\nProceedings of the European Conference on Machine Learning.\n\nProc. ICML\nProceedings of the International Conference on Machine Learning.\n\nProc. IJCAI\nProceedings of the International Joint Conference on Artificial Intelligence.\n\nProc. INEX\nProceedings of the Initiative for the Evaluation of XML Retrieval.\n\nProc. KDD\nProceedings of the ACM SIGKDD International Conference on Knowledge Discovery and Data Mining.\n\nProc. NIPS\nProceedings of the Neural Information Processing Systems Conference.\n\nProc. PODS\nProceedings of the ACM Conference on Principles of Database Systems.\n\nProc. SDAIR\nProceedings of the Annual Symposium on Document Analysis and Information Retrieval.\n\nProc. SIGIR\nProceedings of the Annual International ACM/SIGIR Conference on Research and Development in\nInformation Retrieval.  Available from:\nhttp://www.sigir.org/proceedings/Proc-Browse.html\n\nProc. SPIRE\nProceedings of the Symposium on String Processing and Information Retrieval.\n\nProc. TREC\nProceedings of the Text Retrieval Conference.\n\nProc. UAI\nProceedings of the Conference on Uncertainty in Artificial Intelligence.\n\nProc. VLDB\nProceedings of the Very Large Data Bases Conference.\n\nProc. WWW\nProceedings of the International World Wide Web Conference.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Bibliography\n Up: Link analysis\n Previous: Choosing the subset of\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}