{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/relevance-feedback-on-the-web-1.html",
  "title": "Relevance feedback on the web",
  "body": "\n\n\n\n\nRelevance feedback on the web\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Evaluation of relevance feedback\n Up: Relevance feedback and pseudo\n Previous: When does relevance feedback\n    Contents \n    Index\n\n\n\n\nRelevance feedback on the web\n\n\nSome web search engines offer a similar/related pages feature: the user indicates a document in the results set as exemplary from the standpoint of meeting his information need and requests more documents like it. This can be viewed as a particular simple form of relevance feedback. However, in general relevance feedback has been little used in web search. One exception was the Excite web search engine, which initially provided full relevance feedback. However, the feature was in time dropped, due to lack of use. On the web, few people use advanced search interfaces and most would like to\ncomplete their search in a single interaction. But the lack of uptake also probably\nreflects two other factors: relevance feedback is hard to explain to the\naverage user, and relevance feedback is mainly a recall enhancing\nstrategy, and web search users are only rarely concerned with getting\nsufficient recall.\n\n\nSpink et al. (2000) present results from the use of relevance feedback\nin the Excite search engine. Only about 4% of user query sessions used\nthe relevance feedback option, and these were usually exploiting the\n``More like this''\nlink next to each result. About 70% of users only looked at the\nfirst page of results and did not pursue things any further.\nFor people who used relevance feedback, results were improved\nabout two thirds of the time.\n\n\nAn important more recent thread of work is the use of clickstream data (what links a user clicks on) to provide indirect relevance\nfeedback.  Use of this data is studied in detail in\n(Joachims, 2002b, Joachims et al., 2005). The very\nsuccessful use of web link structure (see Chapter 21 ) can also be\nviewed as implicit feedback, but provided by page authors rather than\nreaders (though in practice most authors are also readers).\n\n\nExercises.\n\nIn Rocchio's algorithm, what weight setting for\n\n does a ``Find\npages like this one'' search correspond to?\n\n\n\nGive three reasons why relevance feedback has been little used in web search.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Evaluation of relevance feedback\n Up: Relevance feedback and pseudo\n Previous: When does relevance feedback\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}