{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/single-link-and-complete-link-clustering-1.html",
  "title": "Single-link and complete-link clustering",
  "body": "\n\n\n\n\nSingle-link and complete-link clustering\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Time complexity of HAC\n Up: Hierarchical clustering\n Previous: Hierarchical agglomerative clustering\n    Contents \n    Index\n\n\n\n\n \n\nSingle-link and complete-link clustering\n\n\nIn  single-link clustering  or \n single-linkage clustering , \nthe similarity of two\nclusters is the similarity of their most similar\nmembers\n(see Figure 17.3 , (a)).\nThis single-link merge criterion is local. We pay attention\nsolely to the area where the two clusters come closest\nto each other. Other, more distant parts of the cluster and\nthe clusters' overall structure are not taken into account.\n\n\nIn  complete-link clustering  or\n complete-linkage\nclustering , the similarity of two clusters is the\nsimilarity of their most dissimilar members (see\nFigure 17.3 , (b)). This is equivalent to\nchoosing the cluster pair whose merge has the smallest\ndiameter.  This complete-link merge criterion is non-local;\nthe entire structure of the clustering can influence merge\ndecisions.  This results in a preference for compact clusters with small diameters\nover long, straggly clusters, but also causes\nsensitivity to outliers. A single document far from the center\ncan increase diameters of candidate merge clusters\ndramatically and completely change the final clustering.\n\n\n\n\nA dendrogram of a \ncomplete-link clustering.The same  30 documents were\n  clustered with single-link clustering in\nFigure 17.1 .\n\n\n\nFigure 17.4  depicts a single-link and\na complete-link clustering of eight documents. The first\nfour steps, each producing a cluster consisting of a pair of two documents, are\nidentical. Then single-link clustering joins the upper two\npairs (and after that the lower two pairs) because\non the maximum-similarity definition of cluster\nsimilarity,\nthose two clusters are closest. Complete-link clustering\njoins the left two pairs (and then the right two pairs)\nbecause those are the closest pairs according to the\nminimum-similarity definition of cluster\nsimilarity.\n\nFigure 17.1 \nis an example of a single-link clustering of a set of\ndocuments and\nFigure 17.5  is the complete-link clustering of\nthe same set.\nWhen cutting the last merge in Figure 17.5 , we\nobtain two clusters of similar size (documents 1-16,\nfrom NYSE closing averages to\nLloyd's chief / U.S. grilling, and\ndocuments 17-30, from Ohio Blue Cross to\nClinton signs law). There is no cut of the dendrogram in\nFigure 17.1  that would give us an equally\nbalanced clustering.\n\n\nBoth single-link and complete-link clustering have\ngraph-theoretic interpretations. Define  to be the\n combination similarity  of the two clusters\nmerged in step , and  the graph that links all\ndata points with a similarity of at least . Then the\nclusters after step  in single-link clustering are the\nconnected components of\n and the clusters after step  in complete-link\nclustering are maximal cliques of\n. A  connected component  is a maximal set of\nconnected points such that there is a path connecting each pair.  A\n clique  is a set of points that are completely linked with\neach other.\n\n\nThese graph-theoretic interpretations motivate the\nterms single-link and complete-link clustering. Single-link\nclusters at step  are maximal sets of points that are linked via at least one\nlink (a single link) of similarity ; complete-link clusters at step\n are\nmaximal sets of points that are completely linked with each other\nvia links of similarity .\n\n\n\n\n\n\nSingle-link and complete-link clustering reduce the\nassessment of cluster quality to a single similarity between\na pair of documents: the two most similar documents in\nsingle-link clustering and the two most dissimilar documents\nin complete-link clustering. A measurement based on one pair\ncannot fully reflect the distribution of documents in a\ncluster. It is therefore not surprising that both algorithms\noften produce undesirable clusters. Single-link clustering can\nproduce straggling clusters as shown in\nFigure 17.6 . Since the merge criterion is strictly\nlocal, a chain of points can be extended for long distances\nwithout regard to the overall shape of the emerging\ncluster. This effect is called  chaining .\n\n\nThe chaining effect is also apparent in Figure 17.1 . \nThe last eleven merges of the single-link clustering\n(those above the\n line)  add on single documents\nor pairs of documents, corresponding to a chain.\nThe complete-link clustering in Figure 17.5  avoids this problem.\nDocuments are split into two\ngroups of roughly equal size when we cut the dendrogram at\nthe last merge. In general, this is a more\nuseful organization of the data than a clustering with chains.\n\n\n\n\n\n\nHowever, complete-link clustering suffers from a different problem. It pays\ntoo much attention to outliers,\npoints that do not fit well into the\nglobal structure of the cluster. In the example in\nFigure 17.7  the four documents \n\nare split because of the outlier  at the left\nedge (Exercise 17.2.1 ). Complete-link clustering does not find the most intuitive\ncluster structure in this example.\n\n\n\n\nSubsections\n\nTime complexity of HAC\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Time complexity of HAC\n Up: Hierarchical clustering\n Previous: Hierarchical agglomerative clustering\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}