{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/acknowledgments-1.html",
  "title": "Acknowledgments",
  "body": "\n\n\n\n\nAcknowledgments\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Web and contact information\n Up: Preface\n Previous: Book layout\n    Contents \n    Index\n\n\n\n\nAcknowledgments\n\n\nWe would like to thank Cambridge University Press for\nallowing us to make the draft book available online, which\nfacilitated much of the feedback we have received while\nwriting the book. We also thank Lauren Cowles, who has been\nan outstanding editor, providing several rounds of comments\non each chapter, on matters of style, organization, and\ncoverage, as well as detailed comments on the subject matter\nof the book. To the extent that we have achieved our goals\nin writing this book, she deserves an important part of the credit.\n\n\nWe are very grateful to the many people who have given us comments,\nsuggestions, and corrections based on draft versions of this\nbook. We thank for providing various corrections and comments:\n Cheryl Aasheim, Josh Attenberg, Daniel Beck, Luc Bélanger,\n Georg Buscher,\n Tom Breuel, Daniel Burckhardt,\n Fazli Can,\n Dinquan Chen, Stephen Clark, Ernest Davis, Pedro Domingos, Rodrigo Panchiniak Fernandes,\n Paolo Ferragina,\n Alex Fraser, Norbert Fuhr, Vignesh Ganapathy,\n Elmer Garduno, Xiubo Geng, David Gondek, Sergio Govoni, Corinna Habets, Ben Handy,\n Donna Harman, Benjamin Haskell, Thomas Hühn, Deepak Jain,\n Ralf Jankowitsch,\n Dinakar Jayarajan,\n Vinay Kakade,  Mei Kobayashi, Wessel Kraaij, Rick Lafleur,\n Florian Laws, Hang Li,\n David Losada, David Mann,\n Ennio Masi,   Sven Meyer zu Eissen, Alexander Murzaku,\n Gonzalo Navarro, Frank McCown,\n Paul McNamee, Christoph Müller, Scott Olsson, Tao Qin, Megha Raghavan,\n Michal Rosen-Zvi, Klaus Rothenhäusler, Kenyu L. Runner, Alexander Salamanca,\n Grigory Sapunov, Evgeny Shadchnev, Tobias Scheffer, Nico Schlaefer, Ian Soboroff, Benno Stein, Marcin Sydow,\n Andrew Turner,\n Jason Utt, Huey Vo,\n Travis Wade, Mike Walsh, Changliang Wang, Renjing Wang, and\n Thomas Zeume.\n\n\nMany people gave us detailed feedback on individual chapters,\neither at our request or through their own initiative.  For this, we're\nparticularly grateful to:\n James Allan, Omar Alonso, Ismail Sengor Altingovde, Vo Ngoc Anh, Roi Blanco, Eric Breck, Eric Brown, Mark Carman, Carlos Castillo, Junghoo Cho, Aron Culotta, Doug Cutting, Meghana Deodhar, Susan Dumais, Johannes Fürnkranz, Andreas Heß, Djoerd Hiemstra, David Hull, Thorsten Joachims, Siddharth Jonathan J. B., Jaap Kamps, Mounia Lalmas, Amy Langville, Nicholas Lester, Dave Lewis, Daniel Lowd, Yosi Mass, Jeff Michels,\n Alessandro Moschitti, Amir Najmi, Marc Najork, Giorgio Maria Di Nunzio, Paul Ogilvie, Priyank Patel, Jan Pedersen, Kathryn Pedings, Vassilis Plachouras, Daniel Ramage, Ghulam Raza, Stefan Riezler, Michael Schiehlen, Helmut Schmid, Falk Nicolas Scholer, Sabine Schulte im Walde, Fabrizio Sebastiani, Sarabjeet Singh, Valentin Spitkovsky, Alexander Strehl, John Tait, Shivakumar Vaithyanathan, Ellen Voorhees, Gerhard Weikum, Dawid Weiss, Yiming Yang, Yisong Yue, Jian Zhang, and\n Justin Zobel. \n\nAnd finally there were a few reviewers who absolutely stood\nout in terms of the quality and quantity of comments that\nthey provided.  We thank them for their significant impact\non the content and structure of the book.  We express our\ngratitude to\n Pavel Berkhin, Stefan Büttcher, Jamie Callan, Byron Dom, Torsten Suel, and\n Andrew Trotman. \n\nParts of the initial drafts of nbayessvm\nwere based on slides that were generously provided by Ray\nMooney. While the material has gone through extensive\nrevisions, we gratefully acknowledge Ray's contribution to\nthe three chapters in general and to the description of the time\ncomplexities of text classification algorithms in\nparticular.\n\n\nThe above is unfortunately an incomplete list: we are still in the\nprocess of incorporating feedback we have received.\nAnd, like all opinionated authors, we did not always heed the advice that was\nso freely given.  The published versions of the chapters remain\nsolely the responsibility of the authors.\n\n\nThe authors thank Stanford University and the University of\nStuttgart for providing a stimulating academic environment for\ndiscussing ideas and the opportunity to teach courses from which\nthis book arose and in which its contents were refined.  CM thanks his\nfamily for the many hours they've let him spend working on this book,\nand hopes he'll have a bit more free time on weekends next year.\nPR thanks his family for their patient\nsupport through the writing of this book and is also\ngrateful to Yahoo! Inc. for providing a fertile environment\nin which to work on this book.  HS would like to thank his parents,\nfamily, and friends for their support while writing this book.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Web and contact information\n Up: Preface\n Previous: Book layout\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}