{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/pivoted-normalized-document-length-1.html",
  "title": "Pivoted normalized document length",
  "body": "\n\n\n\n\nPivoted normalized document length\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: References and further reading\n Up: Variant tf-idf functions\n Previous: Document and query weighting\n    Contents \n    Index\n\n\n\n\n \n\nPivoted normalized document length\n\n\nIn Section 6.3.1  we normalized each document vector by the Euclidean length of the vector, so that all document vectors turned into unit vectors. In doing so, we eliminated all information on the length of the original document; this masks some subtleties about longer documents. First, longer documents will - as a result of containing more terms - have higher tf values. Second, longer documents contain more distinct terms. These factors can conspire to raise the scores of longer documents, which (at least for some information needs) is unnatural. Longer documents can broadly be lumped into two categories: (1) verbose documents that essentially repeat the same content - in these, the length of the document does not alter the relative weights of different terms; (2) documents covering multiple different topics, in which the search terms probably match small segments of the document but not all of it - in this case, the relative weights of terms are quite different from a single short document that matches the query terms. Compensating for this phenomenon is a form of document length normalization that is independent of term and document frequencies. To this end, we introduce a form of normalizing the vector representations of documents in the collection, so that the resulting ``normalized'' documents are not necessarily of unit length. Then, when we compute the dot product score between a (unit) query vector and such a normalized document, the score is skewed to account for the effect of document length on relevance. This form of compensation for document length is known as  pivoted document length normalization .\n\n\n\n\nFigure 6.16:\nPivoted document length normalization.\n\n\n\n\nConsider a document collection together with an ensemble of queries for that collection. Suppose that we were given, for each query  and for each document , a Boolean judgment of whether or not  is relevant to the query ; in Chapter 8  we will see how to procure such a set of relevance judgments for a query ensemble and a document collection. Given this set of relevance judgments, we may compute a probability of relevance as a function of document length, averaged over all queries in the ensemble. The resulting plot may look like the curve drawn in thick lines in Figure 6.16 . To compute this curve, we bucket documents by length and compute the fraction of relevant documents in each bucket, then plot this fraction against the median document length of each bucket.  (Thus even though the ``curve'' in Figure 6.16  appears to be continuous, it is in fact a histogram of discrete buckets of document length.)\n\n\nOn the other hand, the curve in thin lines shows what might happen with the same documents and query ensemble if we were to use relevance as prescribed by cosine normalization Equation 27 - thus, cosine normalization has a tendency to distort the computed relevance vis-à-vis the true relevance, at the expense of longer documents. The thin and thick curves crossover at a point  corresponding to document length , which we refer to as the pivot length; dashed lines mark this point on the  and  axes. The idea of pivoted document length normalization would then be to ``rotate'' the cosine normalization curve counter-clockwise about  so that it more closely matches thick line representing the relevance vs. document length curve. As mentioned at the beginning of this section, we do so by using in Equation 27 a normalization factor for each document vector  that is not the Euclidean length of that vector, but instead one that is larger than the Euclidean length for documents of length less than , and smaller for longer documents.\n\n\nTo this end, we first note that the normalizing term for  in the denominator of Equation 27 is its Euclidean length, denoted . In the simplest implementation of pivoted document length normalization, we use a normalization factor in the denominator that is linear in , but one of slope  as in Figure 6.17 . In this figure, the  axis represents , while the axis represents possible normalization factors we can use. The thin line  depicts the use of cosine normalization.  Notice the following aspects of the thick line representing pivoted length normalization:\n\n\nIt is linear in the document length and has the form\n  \n\n\n\n\n\n(31)\n\n\nwhere  is the cosine normalization value at which the two curves intersect.\n\nIts slope is  and (3) it crosses the  line at piv.\n\n\nIt has been argued that in practice, Equation 31 is well approximated by\n\n\n\n\n\n\n(32)\n\n\nwhere  is the number of unique terms in document .\n\n\n\n\nFigure 6.17:\nImplementing pivoted document length normalization by linear scaling.\n\n\n\n\nOf course, pivoted document length normalization is not appropriate for all applications. For instance, in a collection of answers to frequently asked questions (say, at a customer service website), relevance may have little to do with document length. In other cases the dependency may be more complex than can be accounted for by a simple linear pivoted normalization. In such cases, document length can be used as a feature in the machine learning based scoring approach of Section 6.1.2 .\n\n\nExercises.\n\n One measure of the similarity of two vectors is the  Euclidean\ndistance  (or   distance ) between them:\n\n\n\n\n\n\n\n(33)\n\n\nGiven a query  and documents\n\n, we may rank the documents  in order\nof increasing Euclidean distance from . Show that if \nand the  are all normalized to unit vectors, then the\nrank ordering produced by Euclidean distance is identical to\nthat produced by cosine similarities.\n\n\n\nCompute the vector space similarity between the query\n``digital cameras'' and the  document ``digital cameras and video cameras'' by\nfilling out the empty columns in Table 6.1 . Assume\n\n, logarithmic term weighting (wf columns) for query and\ndocument, idf weighting for the query only and cosine\nnormalization for the document only. Treat and as a\nstop word. Enter term counts in the tf columns. What is the final similarity score?\n\n\n\n\n\nTable 6.1:\nCosine computation for Exercise 6.4.4 .\n\n \nquery\ndocument\n \n\nword\ntf\nwf\ndf\nidf\n\n\ntf\nwf\n\n\n\n\ndigital\n \n \n10,000\n \n \n \n \n \n \n\nvideo\n \n \n100,000\n \n \n \n \n \n \n\ncameras\n \n \n50,000\n \n \n \n \n \n \n\n\n \n\n\n\n\n\n\nShow that for the query affection, the relative ordering of the scores of the three documents in Figure 6.13 is the reverse of the ordering of the scores for the query jealous gossip.\n\n\n\nIn turning a query into a unit vector in Figure 6.13, we assigned equal weights to each of the query terms. What other principled approaches are plausible?\n\n\n\nConsider the case of a query term that is not in the set of  indexed terms; thus our standard construction of the query vector results in  not being in the vector space created from the collection. How would one adapt the vector space representation to handle this case?\n\n\n\nRefer to the tf and idf values for four terms and\nthree documents in Exercise 6.2.2.\nCompute the two top scoring documents on the query\nbest car insurance for each of the\nfollowing weighing schemes: (i) nnn.atc;\n(ii) ntc.atc.\n\n\n\nSuppose that the word coyote does not occur\nin the collection used in Exercises 6.2.2 and\n6.4.4.  How would one compute\nntc.atc scores for the query coyote\ninsurance?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: References and further reading\n Up: Variant tf-idf functions\n Previous: Document and query weighting\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}