{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/computing-scores-in-a-complete-search-system-1.html",
  "title": "Computing scores in a complete search system",
  "body": "\n\n\n\n\nComputing scores in a complete search system\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Efficient scoring and ranking\n Up: irbook\n Previous: References and further reading\n    Contents \n    Index\n\n\n\n\n \n\nComputing scores in a complete search system\n\n\nChapter 6  developed the theory underlying term weighting in documents for the purposes of scoring, leading up to vector space models and the basic cosine scoring algorithm of Section 6.3.3 (page ).  In this chapter we begin in Section 7.1  with heuristics for speeding up this computation; many of these heuristics achieve their speed at the risk of not finding quite the top  documents matching the query.  Some of these heuristics generalize beyond cosine scoring.  With Section 7.1  in place, we have essentially all the components needed for a complete search engine.  We therefore take a step back from cosine scoring, to the more general problem of computing scores in a search engine.  In Section 7.2  we outline a complete search engine, including indexes and structures to support not only cosine scoring but also more general ranking factors such as query term proximity. We describe how all of the various pieces fit together in Section 7.2.4 .  We conclude this chapter with Section 7.3 , where we discuss how the vector space model for free text queries interacts with common query operators.\n\n\n\n\nSubsections\n\nEfficient scoring and ranking\n\nInexact top K document retrieval\nIndex elimination\nChampion lists\nStatic quality scores and ordering\nImpact ordering\nCluster pruning\n\n\nComponents of an information retrieval system\n\nTiered indexes\nQuery-term proximity\nDesigning parsing and scoring functions\nPutting it all together\n\n\nVector space scoring and query operator interaction\n\nBoolean retrieval\nWildcard queries\nPhrase queries\n\n\nReferences and further reading\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Efficient scoring and ranking\n Up: irbook\n Previous: References and further reading\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}