{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/divisive-clustering-1.html",
  "title": "Divisive clustering",
  "body": "\n\n\n\n\nDivisive clustering\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Cluster labeling\n Up: Hierarchical clustering\n Previous: Optimality of HAC\n    Contents \n    Index\n\n\n\n\n \n\nDivisive clustering\n  So far we have only looked at\nagglomerative clustering, but a cluster hierarchy can also\nbe generated top-down. This variant of hierarchical\nclustering is called  top-down clustering  or\n divisive clustering . We start at the top with all\ndocuments in one cluster. The cluster is split using a flat\nclustering algorithm. This procedure is applied recursively\nuntil each document is in its own singleton cluster.\n\n\nTop-down clustering is conceptually more complex than\nbottom-up clustering since we need a second, flat clustering\nalgorithm as a ``subroutine''. It has the advantage of being\nmore efficient if we do not generate a complete hierarchy\nall the way down to individual document leaves.  For a fixed\nnumber of top levels, using an efficient flat algorithm like\n -means, top-down algorithms are linear in the number of\ndocuments and clusters. So they run much faster than HAC\nalgorithms, which are at least quadratic.\n\n\nThere is evidence that divisive algorithms produce more accurate\nhierarchies than bottom-up algorithms in some\ncircumstances. See the references on\nbisecting  -means in Section 17.9 . Bottom-up methods\nmake clustering decisions based on local patterns without\ninitially taking into account the global distribution. These\nearly decisions cannot be undone. Top-down clustering\nbenefits from complete information about the global\ndistribution when making top-level partitioning decisions.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: Cluster labeling\n Up: Hierarchical clustering\n Previous: Optimality of HAC\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}