{
  "url": "http://nlp.stanford.edu/IR-book/html/htmledition/relevance-feedback-and-pseudo-relevance-feedback-1.html",
  "title": "Relevance feedback and pseudo relevance feedback",
  "body": "\n\n\n\n\nRelevance feedback and pseudo relevance feedback\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: The Rocchio algorithm for\n Up: Relevance feedback and query\n Previous: Relevance feedback and query\n    Contents \n    Index\n\n\n\n \n\nRelevance feedback and pseudo relevance feedback\n\n\nThe idea of  relevance feedback \n(  )\nis to involve the\nuser in the retrieval process so as to improve the final\nresult set. In particular, the user gives feedback on the\nrelevance of documents in an initial set of results. The\nbasic procedure is:\n\n\nThe user issues a (short, simple) query.\n\nThe system returns an initial set of retrieval results.\n\nThe user marks some returned documents as relevant or nonrelevant.\n\nThe system computes a better representation of the information need\nbased on the user feedback.\n\nThe system displays a revised set of retrieval results.\n\n\nRelevance feedback can go through one or more iterations of this sort.\nThe process exploits the idea that it may be difficult to formulate a\ngood query when you don't know the collection well, but it is easy to\njudge particular documents, and so it makes sense to engage in iterative\nquery refinement of this sort. In such a scenario,\nrelevance feedback can also be effective in tracking a user's evolving\ninformation need: seeing some documents may lead users to refine\ntheir understanding of the information they are seeking.\n\n\n\n\n\n(a)\n\n\n\n\n(b)\n\n\nRelevance feedback searching over images.(a) The user\n  views the initial query results for a query of bike,\n  selects the first, third and fourth result in the top row and the\n  fourth result in the bottom row as relevant, and submits this\n  feedback.\n  (b) The users sees the revised result set. Precision is greatly improved.\n From\n  http://nayana.ece.ucsb.edu/imsearch/imsearch.html(Newsam et al., 2001).\n\n\nImage search provides a good example of relevance feedback. Not only is it\neasy to see the results at work, but this is a domain where a user can\neasily have difficulty formulating what they want in words, but can\neasily indicate relevant or nonrelevant images. After the user enters an initial query for bike on the demonstration system at:\n\nhttp://nayana.ece.ucsb.edu/imsearch/imsearch.html\n\nthe initial results (in this case, images) are returned. In Figure 9.1 (a), the user has selected some of them as relevant. These will be used to refine the query, while other displayed results have no effect on the reformulation. Figure 9.1 (b) then shows the new top-ranked results calculated after this round of relevance feedback.\n\n\nFigure 9.2  shows a textual IR example where the user wishes to find out about new applications of space satellites.\n\n\n\n\n\n\n\n\nSubsections\n\nThe Rocchio algorithm for relevance feedback\n\nThe underlying theory.\nThe Rocchio (1971) algorithm.\n\n\nProbabilistic relevance feedback\nWhen does relevance feedback work?\nRelevance feedback on the web\nEvaluation of relevance feedback strategies\nPseudo relevance feedback\nIndirect relevance feedback\nSummary\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Next: The Rocchio algorithm for\n Up: Relevance feedback and query\n Previous: Relevance feedback and query\n    Contents \n    Index\n\n\n© 2008 Cambridge University PressThis is an automatically generated page. In case of formatting errors you may want to look at the PDF edition of the book.\n2009-04-07\n\n\n\n"
}